test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       123526;
    }
    farBoundaries
    {
        type            patch;
        nFaces          128;
        startFace       123726;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       123854;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       123974;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          124000;
        startFace       124474;
    }
)

// ************************************************************************* //
